src/main/java/ru/vk/itmo/test/kovalevigor/reports/html/stage5/async_bug_put_16000_wrk.txt
Running 20s test @ http://localhost:8080
  8 threads and 128 connections
  Thread calibration: mean lat.: 7.959ms, rate sampling interval: 40ms
  Thread calibration: mean lat.: 7.996ms, rate sampling interval: 40ms
  Thread calibration: mean lat.: 8.022ms, rate sampling interval: 40ms
  Thread calibration: mean lat.: 8.090ms, rate sampling interval: 42ms
  Thread calibration: mean lat.: 7.927ms, rate sampling interval: 40ms
  Thread calibration: mean lat.: 7.967ms, rate sampling interval: 40ms
  Thread calibration: mean lat.: 7.941ms, rate sampling interval: 40ms
  Thread calibration: mean lat.: 7.966ms, rate sampling interval: 40ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    11.84ms   12.35ms  98.94ms   86.36%
    Req/Sec     2.03k   341.11     5.47k    76.37%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    7.73ms
 75.000%   17.09ms
 90.000%   28.40ms
 99.000%   52.90ms
 99.900%   81.15ms
 99.990%   92.22ms
 99.999%   97.60ms
100.000%   99.01ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.204     0.000000            1         1.00
       1.467     0.100000        15889         1.11
       2.113     0.200000        31790         1.25
       3.227     0.300000        47660         1.43
       5.187     0.400000        63550         1.67
       7.731     0.500000        79410         2.00
       9.087     0.550000        87395         2.22
      10.359     0.600000        95289         2.50
      12.143     0.650000       103229         2.86
      14.687     0.700000       111194         3.33
      17.087     0.750000       119122         4.00
      18.319     0.775000       123142         4.44
      19.631     0.800000       127104         5.00
      21.103     0.825000       131040         5.71
      23.023     0.850000       135018         6.67
      25.343     0.875000       138977         8.00
      26.639     0.887500       140958         8.89
      28.399     0.900000       142937        10.00
      30.431     0.912500       144919        11.43
      32.527     0.925000       146906        13.33
      34.847     0.937500       148903        16.00
      36.095     0.943750       149904        17.78
      37.887     0.950000       150881        20.00
      39.967     0.956250       151873        22.86
      42.079     0.962500       152867        26.67
      43.871     0.968750       153867        32.00
      44.671     0.971875       154346        35.56
      45.599     0.975000       154853        40.00
      46.591     0.978125       155339        45.71
      47.775     0.981250       155840        53.33
      49.311     0.984375       156340        64.00
      50.111     0.985938       156588        71.11
      51.135     0.987500       156830        80.00
      52.223     0.989062       157080        91.43
      53.439     0.990625       157330       106.67
      55.359     0.992188       157574       128.00
      56.959     0.992969       157697       142.22
      58.719     0.993750       157820       160.00
      61.503     0.994531       157944       182.86
      64.223     0.995313       158068       213.33
      67.775     0.996094       158192       256.00
      69.823     0.996484       158254       284.44
      71.743     0.996875       158318       320.00
      73.983     0.997266       158378       365.71
      75.647     0.997656       158440       426.67
      77.503     0.998047       158502       512.00
      78.335     0.998242       158535       568.89
      79.039     0.998437       158567       640.00
      79.551     0.998633       158595       731.43
      80.319     0.998828       158627       853.33
      81.279     0.999023       158658      1024.00
      82.175     0.999121       158673      1137.78
      83.007     0.999219       158688      1280.00
      83.711     0.999316       158704      1462.86
      84.671     0.999414       158721      1706.67
      85.247     0.999512       158735      2048.00
      85.695     0.999561       158743      2275.56
      86.079     0.999609       158750      2560.00
      86.655     0.999658       158758      2925.71
      87.231     0.999707       158766      3413.33
      88.255     0.999756       158774      4096.00
      88.639     0.999780       158778      4551.11
      89.279     0.999805       158781      5120.00
      89.791     0.999829       158785      5851.43
      90.431     0.999854       158789      6826.67
      90.943     0.999878       158793      8192.00
      91.583     0.999890       158795      9102.22
      92.287     0.999902       158797     10240.00
      93.759     0.999915       158799     11702.86
      94.399     0.999927       158801     13653.33
      95.167     0.999939       158803     16384.00
      95.615     0.999945       158804     18204.44
      96.319     0.999951       158805     20480.00
      96.511     0.999957       158806     23405.71
      97.087     0.999963       158807     27306.67
      97.151     0.999969       158808     32768.00
      97.151     0.999973       158808     36408.89
      97.343     0.999976       158809     40960.00
      97.343     0.999979       158809     46811.43
      97.599     0.999982       158810     54613.33
      97.599     0.999985       158810     65536.00
      97.599     0.999986       158810     72817.78
      97.983     0.999988       158811     81920.00
      97.983     0.999989       158811     93622.86
      97.983     0.999991       158811    109226.67
      97.983     0.999992       158811    131072.00
      97.983     0.999993       158811    145635.56
      99.007     0.999994       158812    163840.00
      99.007     1.000000       158812          inf
#[Mean    =       11.844, StdDeviation   =       12.346]
#[Max     =       98.944, Total count    =       158812]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  319358 requests in 20.00s, 37.77MB read
Requests/sec:  15968.52
Transfer/sec:      1.89MB