src/main/java/ru/vk/itmo/test/kovalevigor/reports/html/stage5/sync_put_13500_wrk.txt
Running 20s test @ http://localhost:8080
  8 threads and 128 connections
  Thread calibration: mean lat.: 813.484ms, rate sampling interval: 2891ms
  Thread calibration: mean lat.: 812.954ms, rate sampling interval: 2891ms
  Thread calibration: mean lat.: 813.433ms, rate sampling interval: 2891ms
  Thread calibration: mean lat.: 813.322ms, rate sampling interval: 2891ms
  Thread calibration: mean lat.: 813.415ms, rate sampling interval: 2891ms
  Thread calibration: mean lat.: 813.692ms, rate sampling interval: 2891ms
  Thread calibration: mean lat.: 813.694ms, rate sampling interval: 2893ms
  Thread calibration: mean lat.: 814.013ms, rate sampling interval: 2893ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.28s   403.09ms   2.97s    57.24%
    Req/Sec     1.40k    10.04     1.41k    66.67%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.30s 
 75.000%    2.62s 
 90.000%    2.83s 
 99.000%    2.94s 
 99.900%    2.97s 
 99.990%    2.97s 
 99.999%    2.97s 
100.000%    2.97s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    1567.743     0.000000            1         1.00
    1713.151     0.100000        11095         1.11
    1849.343     0.200000        22211         1.25
    1980.415     0.300000        33251         1.43
    2154.495     0.400000        44380         1.67
    2301.951     0.500000        55432         2.00
    2369.535     0.550000        61089         2.22
    2422.783     0.600000        66503         2.50
    2488.319     0.650000        72118         2.86
    2549.759     0.700000        77693         3.33
    2617.343     0.750000        83157         4.00
    2660.351     0.775000        85986         4.44
    2691.071     0.800000        88790         5.00
    2727.935     0.825000        91532         5.71
    2764.799     0.850000        94393         6.67
    2795.519     0.875000        97082         8.00
    2811.903     0.887500        98374         8.89
    2832.383     0.900000        99837        10.00
    2848.767     0.912500       101263        11.43
    2861.055     0.925000       102536        13.33
    2877.439     0.937500       104010        16.00
    2883.583     0.943750       104620        17.78
    2891.775     0.950000       105405        20.00
    2897.919     0.956250       106103        22.86
    2906.111     0.962500       106765        26.67
    2916.351     0.968750       107563        32.00
    2918.399     0.971875       107739        35.56
    2922.495     0.975000       108101        40.00
    2926.591     0.978125       108436        45.71
    2930.687     0.981250       108760        53.33
    2934.783     0.984375       109179        64.00
    2936.831     0.985938       109375        71.11
    2938.879     0.987500       109567        80.00
    2940.927     0.989062       109728        91.43
    2942.975     0.990625       109870       106.67
    2945.023     0.992188       110007       128.00
    2947.071     0.992969       110142       142.22
    2949.119     0.993750       110264       160.00
    2949.119     0.994531       110264       182.86
    2951.167     0.995313       110340       213.33
    2955.263     0.996094       110437       256.00
    2957.311     0.996484       110486       284.44
    2959.359     0.996875       110551       320.00
    2959.359     0.997266       110551       365.71
    2961.407     0.997656       110632       426.67
    2961.407     0.998047       110632       512.00
    2963.455     0.998242       110718       568.89
    2963.455     0.998437       110718       640.00
    2963.455     0.998633       110718       731.43
    2963.455     0.998828       110718       853.33
    2965.503     0.999023       110786      1024.00
    2965.503     0.999121       110786      1137.78
    2965.503     0.999219       110786      1280.00
    2965.503     0.999316       110786      1462.86
    2965.503     0.999414       110786      1706.67
    2965.503     0.999512       110786      2048.00
    2967.551     0.999561       110825      2275.56
    2967.551     0.999609       110825      2560.00
    2967.551     0.999658       110825      2925.71
    2967.551     0.999707       110825      3413.33
    2967.551     0.999756       110825      4096.00
    2967.551     0.999780       110825      4551.11
    2967.551     0.999805       110825      5120.00
    2967.551     0.999829       110825      5851.43
    2967.551     0.999854       110825      6826.67
    2967.551     0.999878       110825      8192.00
    2967.551     0.999890       110825      9102.22
    2969.599     0.999902       110835     10240.00
    2969.599     0.999915       110835     11702.86
    2969.599     0.999927       110835     13653.33
    2969.599     0.999939       110835     16384.00
    2969.599     0.999945       110835     18204.44
    2969.599     0.999951       110835     20480.00
    2969.599     0.999957       110835     23405.71
    2969.599     0.999963       110835     27306.67
    2969.599     0.999969       110835     32768.00
    2969.599     0.999973       110835     36408.89
    2969.599     0.999976       110835     40960.00
    2969.599     0.999979       110835     46811.43
    2969.599     0.999982       110835     54613.33
    2969.599     0.999985       110835     65536.00
    2969.599     0.999986       110835     72817.78
    2969.599     0.999988       110835     81920.00
    2969.599     0.999989       110835     93622.86
    2969.599     0.999991       110835    109226.67
    2971.647     0.999992       110836    131072.00
    2971.647     1.000000       110836          inf
#[Mean    =     2275.614, StdDeviation   =      403.090]
#[Max     =     2969.600, Total count    =       110836]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  221004 requests in 20.00s, 26.13MB read
Requests/sec:  11051.11
Transfer/sec:      1.31MB